Ell-i/Arduino/hardware/arduino/sam/boards.txt

arduino_due_x_dbg.name=Arduino Due (Programming Port)
arduino_due_x_dbg.upload.tool=bossac
arduino_due_x_dbg.upload.protocol=sam-ba
arduino_due_x_dbg.upload.maximum_size=524288
arduino_due_x_dbg.upload.use_1200bps_touch=true
arduino_due_x_dbg.upload.wait_for_upload_port=false
arduino_due_x_dbg.upload.native_usb=false
arduino_due_x_dbg.build.mcu=cortex-m3
arduino_due_x_dbg.build.f_cpu=84000000L
arduino_due_x_dbg.build.board=SAM_DUE
arduino_due_x_dbg.build.core=arduino
arduino_due_x_dbg.build.extra_flags=-D__SAM3X8E__ -mthumb -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
arduino_due_x_dbg.build.library.c.flags="-I{build.system.path}/libsam" "-I{build.system.path}/CMSIS/CMSIS/Include/" "-I{build.system.path}/CMSIS/Device/ATMEL/"
arduino_due_x_dbg.build.ldscript=linker_scripts/gcc/flash.ld
arduino_due_x_dbg.build.variant=arduino_due_x
arduino_due_x_dbg.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
arduino_due_x_dbg.build.vid=0x2341
arduino_due_x_dbg.build.pid=0x003e

arduino_due_x.name=Arduino Due (Native USB Port)
arduino_due_x.upload.tool=bossac
arduino_due_x.upload.protocol=sam-ba
arduino_due_x.upload.maximum_size=524288
arduino_due_x.upload.use_1200bps_touch=true
arduino_due_x.upload.wait_for_upload_port=true
arduino_due_x.upload.native_usb=true
arduino_due_x.build.mcu=cortex-m3
arduino_due_x.build.f_cpu=84000000L
arduino_due_x.build.board=SAM_DUE
arduino_due_x.build.core=arduino
arduino_due_x.build.extra_flags=-D__SAM3X8E__ -mthumb -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
arduino_due_x.build.library.c.flags="-I{build.system.path}/libsam" "-I{build.system.path}/CMSIS/CMSIS/Include/" "-I{build.system.path}/CMSIS/Device/ATMEL/"
arduino_due_x.build.ldscript=linker_scripts/gcc/flash.ld
arduino_due_x.build.variant=arduino_due_x
arduino_due_x.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
arduino_due_x.build.vid=0x2341
arduino_due_x.build.pid=0x003e

ellduino_stm32f051.name=Ell-duino (Serial Cable)
ellduino_stm32f051.upload.tool=stm32flash
ellduino_stm32f051.upload.protocol=stm
ellduino_stm32f051.upload.maximum_size=65535
ellduino_stm32f051.upload.wait_for_upload_port=false
ellduino_stm32f051.upload.native_usb=false
ellduino_stm32f051.build.mcu=cortex-m0
ellduino_stm32f051.build.f_cpu=84000000LXXX
ellduino_stm32f051.build.board=ELLI_STM32F051
ellduino_stm32f051.build.core=arduino
ellduino_stm32f051.build.extra_flags=-mthumb -D__STM32F051__ -std=gnu99
ellduino_stm32f051.build.library.c.flags="-I{build.system.path}/libstm32f/include" "-I{build.system.path}/CMSIS/CMSIS/Include"
ellduino_stm32f051.build.ldscript=linker_scripts/gcc/flash.ld
ellduino_stm32f051.build.variant=ellduino_stm32f051
ellduino_stm32f051.build.variant_system_lib=libstm32f_051_gcc_rel.a

discovery_stm32f051.name=STM32F0discovery (USB)
discovery_stm32f051.upload.tool=stflash
discovery_stm32f051.upload.protocol=stm
discovery_stm32f051.upload.maximum_size=65535
discovery_stm32f051.upload.wait_for_upload_port=false
discovery_stm32f051.upload.native_usb=true
discovery_stm32f051.build.mcu=cortex-m0
discovery_stm32f051.build.f_cpu=84000000LXXX
discovery_stm32f051.build.board=ELLI_STM32F051
discovery_stm32f051.build.core=arduino
discovery_stm32f051.build.extra_flags=-mthumb -D__STM32F051__ -std=gnu99
discovery_stm32f051.build.library.c.flags="-I{build.system.path}/libstm32f/include" "-I{build.system.path}/CMSIS/CMSIS/Include"
discovery_stm32f051.build.ldscript=linker_scripts/gcc/flash.ld
discovery_stm32f051.build.variant=ellduino_stm32f051
discovery_stm32f051.build.variant_system_lib=libstm32f_051_gcc_rel.a
